<?php

$lang['required']			= "Поле %s є обов'язковим.";
$lang['isset']				= "Поле %s має мати значення.";
$lang['valid_email']		= "Поле %s має містити дійсну електронну адресу.";
$lang['valid_emails']		= "Поле %s має містити всі дійсні адреси електронної пошти.";
$lang['valid_url']			= "Поле %s має містити дійсну URL-адресу.";
$lang['valid_ip']			= "Поле %s повинно містити дійсний IP.";
$lang['min_length']			= "Поле %s має містити щонайменше %s символів.";
$lang['max_length']			= "Поле %s не може перевищувати %s символів.";
$lang['exact_length']		= "Поле %s має складати рівно %s символів.";
$lang['alpha']				= "Поле %s може містити лише алфавітні символи.";
$lang['alpha_numeric']		= "Поле %s може містити лише буквено-цифрові символи.";
$lang['alpha_dash']			= "Поле %s може містити лише буквено-цифрові символи, підкреслення та тире.";
$lang['numeric']			= "Поле %s має містити лише цифри.";
$lang['is_numeric']			= "Поле %s має містити лише числові символи.";
$lang['integer']			= "Поле %s має містити ціле число.";
$lang['regex_match']		= "Поле %s має неправильний формат.";
$lang['matches']			= "Поле %s не відповідає полю %s.";
$lang['is_unique'] 			= "Поле %s повинно містити унікальне значення.";
$lang['is_natural']			= "Поле %s має містити лише додатні числа.";
$lang['is_natural_no_zero']	= "Поле %s повинно містити число більше нуля.";
$lang['decimal']			= "Поле %s повинно містити десяткове число.";
$lang['less_than']			= "Поле %s має містити число менше, ніж %s.";
$lang['greater_than']		= "Поле %s має містити число більше, ніж %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */